# 16: Menata ulang Data Frame dengan mutiple indexes menggunakan unstack()

# Import Modules

In [5]:
import pandas as pd

print(pd.__version__)

2.2.2

# Persiapan Data Frame

In [7]:
df = pd.read_csv('C:/Users/vika/Downloads/titanicfull.csv')
print(df.head())

   pclass  survived                                             name     sex  \
0       1         1                    Allen, Miss. Elisabeth Walton  female
1       1         1                   Allison, Master. Hudson Trevor    male
2       1         0                     Allison, Miss. Helen Loraine  female
3       1         0             Allison, Mr. Hudson Joshua Creighton    male
4       1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

     age  sibsp  parch  ticket      fare    cabin embarked
0  29.00      0      0   24160  211.3375       B5        S
1   0.92      1      2  113781  151.5500  C22 C26        S
2   2.00      1      2  113781  151.5500  C22 C26        S
3  30.00      1      2  113781  151.5500  C22 C26        S
4  25.00      1      2  113781  151.5500  C22 C26        S

# Data Frame dengan multiple indexes dari hasil groupping

In [10]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

# Menata ulang Data Frame dengan mutiple indexes

In [13]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130